// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное само на себя).

// Например: 
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine()!);
int result = number * number;
Console.WriteLine("Квадрат числа равен = " + result + ".");





