// Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.
// 456 -> 46
// 782 -> 72
// 918 -> 98

/*string name = "Tom";  // определяем переменную и инициализируем ее
  
Console.WriteLine(name);    // Tom
  
name = "Bob";       // меняем значение переменной
Console.WriteLine(name);    // Bob*/

Console.Clear();
//Console.WriteLine(15);

string name = "Tom";
int age = 33;
bool isEmployed = false;
double weight = 78.65;
 
Console.WriteLine($"Имя: {name}");
Console.WriteLine($"Возраст: {age}");
Console.WriteLine($"Вес: {weight}");
Console.WriteLine($"Работает: {isEmployed}");